# clear() - Удаляет все элементы из словаря
# copy() - Возвращает копию словаря
# fromkeys(seq[, value]) - Создает словарь из заданной последовательности seq
# get() - Возвращает значение для данного ключа
# pop() - Возвращает и удаляет элемент с заданным ключом
# items() - Вернуть список со всеми ключами словаря со значениями
# keys() - Возвращает объект представления, который отображает список всех ключей словаря в порядке вставки.
# popitem() - Возвращает и удаляет пару ключ-значение из словаря.
# setdefault() - Возвращает значение ключа, если ключ находится в словаре, иначе вставляет ключ со значением в словарь.
# values() - Возвращает объект представления, содержащий все значения словаря,
# к которым можно получить доступ и эффективно перебирать их.
# upload() - Обновляет словарь элементами из другого словаря или итерацией пар ключ-значение.
# С помощью этого метода вы можете включать новые данные или объединять их с существующими словарными статьями.
